Repository: giellalt/corpus-sme
Catalog: prestable/tmx/nob/facta/skuvlahistorja4/sverre-s.htm.tmx
Source language: sme
Languages: nob

source: Mun in leat áibbas sihkar manne mun sáddejuvvojin ruoktot , lei várra psykologa gii dan áigge lei jođiheaddjin gii váikkuhii dasa .
nob: Jeg er ikke helt sikker på hvorfor jeg ble sendt hjem , det er mulig at det var psykologen som var styrer der på den tida som medvirket til det .

source: Šattai veahá buoret dilli Varna skuvlaruovttus go psykologa šattai jođiheaddjin .
nob: Det ble litt bedre kår da psykologen ble leder på Varna skolehjem .

source: Ii lean álki boahtit ruovttoluotta maŋŋá go ledjen leamaš eret golbma jagi dábálaš skuvllas .
nob: Det var ikke enkelt å komme tilbake etter tre år borte fra normalskolen .

source: Mun in lean oahppan doarvái nu ahte sáhtten čuovvot dábálaš oahpahusa ja mun in nagodan heivehit skuvlii .
nob: Jeg hadde ikke lært tilstrekkelig til at jeg kunne følge den vanlige skolen og jeg klarte ikke tilpasse meg skolen .

source: Mun čađahin skuvlla vuollegaš diehtodásis .
nob: Jeg fullførte da skolen med lavt kunnskapsnivå .

source: Nugo hui olu eará Kárášjot-gánddat , mannen mun meara ala go gergen skuvllas .
nob: Som veldig mange andre gutter fra Karasjok , reiste jeg til sjøs rett etter at jeg ble ferdig på skolen .

source: Varna skuvla eanandoallorusttegiin , sullii 1955 .
nob: Varna skole med gårdsanlegg omkring 1955

source: ( Gova luoikan Våler ja Svinndal historielag )
nob: ( Foto utlånt av Våler og Svinndal historielag )

source: Geaidnu boahtteáigái
nob: Veien inn til framtida

source: – Moadde jagi maŋŋá meara alde , vázzen mun Romssa mašinistaskuvlla .
nob: Etter noen år til sjøs , gikk jeg på Tromsø maskinistskole .

source: Lean álohii leamaš čeahppi gieđaiguin , ja álgogeahčái 1980-logu vázzen fidnoskuvlla šaddat viessogálvosnihkkárin .
nob: Jeg har bestandig vært flink med hendene , og i begynnelsen av 1980 tallet gikk jeg på yrkesskole for å bli møbelsnekker .

source: Álggos jagi Guovdageainnus , ja nuppi jagi Álttás .
nob: Først et år i Kautokeino , så neste år i Alta .

source: Lean álohii liikon tevdnet ja bargat garradujiin , nu ahte leat olusat geain leat iešguđetgelágan tevnnegat ja buktagat maid lean ráhkadan .
nob: Jeg har bestandig likt å tegne og jobbe med tresløyd , så det er mange som har ulike tegninger og produkter som jeg har produsert .

source: Tevnnegat ja garraduodji šadde munnje dán suorggi máhtolašvuođa duođaštussan .
nob: Tegningene og tresløyden var en form for anerkjennelse av min kompetanse på feltet .

source: Sverre Somby sárggastus . ( Govva : Gunn Marit Bratsberg )
nob: Tegning av Sverre Somby ( Foto : Gunn Marit Bratsberg )

source: Kárášjoga mánáidskuvla dárbbašii duodjeoahpaheaddji , ja mun ožžon sadjásašvirggi doppe .
nob: Barneskolen i Karasjok trengte duodjilærer , og jeg fikk vikarjobb på skolen .

source: Bárgu sadjásašoahpaheaddjin attii munnje movtta lohkat pedagogihka , ja dan láhkai oažžut bistevaš virggi fágaoahpaheaddjin .
nob: Jobben som lærervikar , ga meg motivasjon til å ta pedagogikken , og på den måten få fast jobb som faglærer .

source: Mun ožžon oalgguhusa váldit pedagogihka iežan buori bárgoskihpáris Piera Jouni Sombys .
nob: Jeg ble motivert til å ta pedagogikken av min gode kollega Piera Jouni Somby .

source: Dál barggan ain oahpaheaddjin dan seammá skuvllas gos mun oktii in ožžon leat oahppin .
nob: I dag jobber jeg fortsatt som lærer ved den samme skolen som jeg i sin tid ikke fikk lov til å være elev ved .

source: Ja seamma skuvla mii ovttaláhkai lei veahkaválddálaš váilevašvuođainis árvvoštallat erenoamášoahpahusa ja heivehuvvon oahpahusa nu ahte livččen sáhttit orrut birrasis maid dovden .
nob: Og den skolen som nærmest begikk et overgrep i mangelen på å vurdere spesialundervisning og tilrettelegging slik at jeg kunne være elev og bo i det miljøet jeg kjente .

source: Ahte mu oktii válde ruovttus dego stuorra skealmma giehtaruvddiin , gitta dasa ahte mun ieš barggan oahpaheaddjin otne čájeha ahte dat lea geavvan ollu skuvllas ja das man láhkai skuvla láhčá dili ohppiide .
nob: At jeg en gang ble ført bort fra hjemmet som en stor forbryter i håndjern og til i dag når jeg selv jobber som lærer , viser at det har skjedd mye i skolen og med måten skolen legger til rette for elevene .

source: Mun lean ilus ja giitevaš ahte diekkár veahkaválddalašvuođat man čađa mun lean leamaš eai leat lobálaččat otne , ja ahte erenoamášskuvllat eai gávdno šat .
nob: Jeg er glad for at slike overgrep ikke er tillatt i dag , og at spesialskolene ikke lenger fins .

source: [ 1 ] http://www.nrk.no/nyheter/distrikt/ostlandssendingen/1 . 364952 [ 2 ] Sigvald Løkeland : Oversikt over Statens spesialskoler 1825–1992. http://www.skolenettet.no/nyupload/Moduler/Statped/Enheter/Statped%20Vest/Statens_spesialskoler1825_til_1992.doc .
nob: [ 1 ] http://www.nrk.no/nyheter/distrikt/ostlandssendingen/1.364952v [ 2 ] Sigvald Løkeland : Oversikt over Statens spesialskoler 1825 – 1992. http://www.skolenettet.no/nyupload/Moduler/Statped/Enheter/Statped%20Vest/Statens_spesialskoler1825_til_1992.doc .

source: Eará artihkkalat girjjis Sámi skuvlahistorjá 4
nob: Flere artikler fra Samisk skolehistorie 4
